bouffalolab/bl_iot_sdk-components/platform/soc/bl702/bl702_ethernet/Src/eth_bd.c

#include <string.h>

#include <utils_log.h>
#include <utils_list.h>

#include <emac_reg.h>
#include <bl_irq.h>
#include <bl702_common.h>
#include <bl702_glb.h>
#include <bl_emac.h>

#include <bl_timer.h>
#include <bl_gpio.h>

#include <lwip/netifapi.h>
#include <lwip/mem.h>
#include <netif/etharp.h>
#include <ethernetif.h>
#if LWIP_IPV6
#include <lwip/ethip6.h>
#include <lwip/dhcp6.h>
#endif /* LWIP_IPV6 */

#include <FreeRTOS.h>
#include <task.h>

#include "eth_bd.h"
#include "eth_phy.h"
#include "ephy_general.h"

#define printf(...)  do {}while(0)
#define MSG(...)     do {}while(0)

#define USER_EMAC_OUTSIDE_CLK  (1)

EMAC_Handle_Type ethHandle = {0};
static EMAC_Handle_Type *thiz = NULL;
eth_context *ctx = NULL;
TaskHandle_t DequeueTaskHandle = NULL;
struct netif eth_mac = {0};
#define ETH_MAX_BUFFER_SIZE        (1536)
#if 0
uint32_t tx_buf[ETH_TXNB][(ETH_MAX_BUFFER_SIZE + 3)/4];/* Ethernet Transmit Buffers */
uint32_t rx_buf[ETH_RXNB][(64 + ETH_MAX_BUFFER_SIZE + 3)/4] = {0};/* Ethernet Transmit Buffers */
#else 
uint8_t tx_buf[ETH_TXNB][ETH_MAX_BUFFER_SIZE] __ALIGNED__(4); /* Ethernet Transmit Buffers */
uint8_t rx_buf[ETH_RXNB][ETH_MAX_BUFFER_SIZE + 64] __ALIGNED__(4)={0}; /* Ethernet Receive Buffers */
#endif

static eth_callback p_eth_callback = NULL;
static bool is_link_up = false;

static eth_phy_ctrl_t phy_ctrl;
static eth_phy_init_cfg_t phy_cfg = {
    .speed_mode = EPHY_SPEED_MODE_AUTO_NEGOTIATION,
    .local_auto_negotiation_ability = EPHY_ABILITY_100M_TX | EPHY_ABILITY_100M_FULL_DUPLEX,
};
static ETHPHY_CFG_Type phyCfg = {
    .autoNegotiation = ENABLE,                  /*!< Speed and mode auto negotiation */
    .duplex = EMAC_MODE_FULLDUPLEX,             /*!< Duplex mode */
    .speed = EMAC_SPEED_100M,                   /*!< Speed mode */
    .phyAddress = 0x1,                          /*!< PHY address */
};

int EMAC_DMABDListInit(EMAC_Handle_Type *handle,uint8_t *txBuff, uint32_t txBuffCount,uint8_t *rxBuff, uint32_t rxBuffCount)
{
    uint32_t i = 0;

    /* Set the Ethernet handler env */
    handle->bd = (EMAC_BD_Desc_Type *)(EMAC_BASE+EMAC_DMA_DESC_OFFSET);
    handle->txIndexEMAC = 0;
    handle->txIndexCPU  = 0;
    handle->txBuffLimit = txBuffCount - 1;
    /* The receive descriptors' address starts right after the last transmit BD. */
    handle->rxIndexEMAC = txBuffCount;
    handle->rxIndexCPU  = txBuffCount;
    handle->rxBuffLimit = txBuffCount + rxBuffCount - 1;
    for(i=0; i < txBuffCount; i++){
        /* Get the pointer on the ith member of the Tx Desc list */
        //handle->bd[i].Buffer= (NULL == txBuff) ? 0 : (uint32_t)((uint8_t *)txBuff+(ETH_MAX_BUFFER_SIZE*i)); //(uint32_t)tx_desc[i].buf;
        handle->bd[i].Buffer= (NULL == txBuff) ? 0 : (uint32_t)(txBuff+(ETH_MAX_BUFFER_SIZE*i)); //(uint32_t)tx_desc[i].buf;
        handle->bd[i].C_S_L = 0;
    }
    handle->bd[handle->txBuffLimit].C_S_L |= EMAC_BD_FIELD_MSK(TX_WR);

    for(i = txBuffCount; i < (txBuffCount + rxBuffCount); i++){
        /* Get the pointer on the ith member of the Rx Desc list */
        handle->bd[i].Buffer= (NULL == rxBuff) ? 0 : (uint32_t)(rxBuff + (ETH_MAX_BUFFER_SIZE + 64) * (i - txBuffCount) + 64);
        handle->bd[i].C_S_L = (ETH_MAX_BUFFER_SIZE << 16) |
                               EMAC_BD_FIELD_MSK(RX_IRQ) |
                               EMAC_BD_FIELD_MSK(RX_E);
    }
    /* For the last RX DMA Descriptor, it should be wrap back */
    handle->bd[handle->rxBuffLimit].C_S_L |= EMAC_BD_FIELD_MSK(RX_WR);
    
    /* For the TX DMA Descriptor, it will wrap to 0 according to EMAC_TX_BD_NUM*/
    BL_WR_REG(EMAC_BASE, EMAC_TX_BD_NUM,txBuffCount);
    
    return SUCCESS;
}

static void EMAC_GPIO_Init(void)
{
    GLB_GPIO_Type emacPins[]={GLB_GPIO_PIN_0,GLB_GPIO_PIN_1,GLB_GPIO_PIN_2,
                        GLB_GPIO_PIN_7,GLB_GPIO_PIN_8,
                        GLB_GPIO_PIN_18,GLB_GPIO_PIN_19,GLB_GPIO_PIN_20,GLB_GPIO_PIN_21,GLB_GPIO_PIN_22};

    GLB_SWAP_EMAC_CAM_Pin(GLB_EMAC_CAM_PIN_EMAC);

    GLB_GPIO_Func_Init(GPIO_FUN_ETHER_MAC,(GLB_GPIO_Type *)emacPins,sizeof(emacPins) / sizeof(GLB_GPIO_Type));
}

int EMAC_BD_Init(void)
{
    int err = SUCCESS;
    thiz = &ethHandle;
    ctx = pvPortMalloc(sizeof(eth_context));
    memset(ctx, 0, sizeof(eth_context));
    utils_list_init(&ctx->unsent);
    /* init the BDs in emac with buffer address */
    //err = EMAC_DMABDListInit(thiz, NULL, ETH_TXNB, (uint8_t*)rx_buf, ETH_RXNB);
    err = EMAC_DMABDListInit(thiz, (uint8_t*)tx_buf, ETH_TXNB, (uint8_t*)rx_buf, ETH_RXNB);
    printf("bd init success\r\n");

    return err;
}

static inline uint8_t emac_bd_get_cur_rx_buffer_active(void)
{
    uint32_t bd = 0;

    bd = BL_RD_REG(EMAC_BASE, EMAC_TX_BD_NUM);

    bd &= EMAC_RXBDPTR_MSK;
    bd >>= EMAC_RXBDPTR_POS;

    return (uint8_t)(bd & 0xff);
}

static inline uint8_t emac_bd_get_cur_tx_buffer_active(void)
{
    uint32_t bd = 0;

    bd = BL_RD_REG(EMAC_BASE, EMAC_TX_BD_NUM);
    bd &= EMAC_TXBDPTR_MSK;
    bd >>= EMAC_TXBDPTR_POS;

    return (uint8_t)(bd & 0xff);
}

void EMAC_TX_Done_Callback(void)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    if (NULL == DequeueTaskHandle) {
        return;
    }

    xTaskNotifyFromISR(DequeueTaskHandle, 0x01, eSetBits, &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
}

void EMAC_TX_Error_Callback(int index)
{
    /* handle error */
    if (thiz->bd[index].C_S_L & EMAC_BD_FIELD_MSK(TX_UR)) {
        printf("TX error EMAC_BD_TX_UR_MASK @%d\r\n", index);
    }

    if (thiz->bd[index].C_S_L & EMAC_BD_FIELD_MSK(TX_RTRY)) {
        printf("TX error EMAC_BD_TX_RTRY_MASK @%d\r\n", index);
    }

    if (thiz->bd[index].C_S_L & EMAC_BD_FIELD_MSK(TX_RL)) {
        printf("TX error EMAC_BD_TX_RL_MASK @%d\r\n", index);
    }

    if (thiz->bd[index].C_S_L & EMAC_BD_FIELD_MSK(TX_LC)) {
        printf("TX error EMAC_BD_TX_LC_MASK @%d\r\n", index);
    }

    if (thiz->bd[index].C_S_L & EMAC_BD_FIELD_MSK(TX_DF)) {
        printf("TX error EMAC_BD_TX_DF_MASK @%d\r\n", index);
    }

    if (thiz->bd[index].C_S_L & EMAC_BD_FIELD_MSK(TX_CS)) {
        printf("TX error EMAC_BD_TX_CS_MASK @%d\r\n", index);
    }

    thiz->bd[index].C_S_L &= ~0xff;
}

