bouffalolab/bl_iot_sdk-components/platform/soc/bl702/bl702_ethernet/Src/eth_bd.c
#if 0
static void rx_free_custom(struct pbuf *p)
{
#if 0
    eth_pbuf_custom_t *my_pbuf = (eth_pbuf_custom_t *)p;
    EMAC_BD_Desc_Type *bd;
    bd = my_pbuf->bd;
    bd->C_S_L |= EMAC_BD_FIELD_MSK(RX_E);
    printf("release bd idx %ld\r\n", my_pbuf->idx);

#else
    eth_pbuf_custom_t *my_pbuf = (eth_pbuf_custom_t *)p;
    EMAC_BD_Desc_Type *bd;

    /*put back BD buffer to the front of the ring*/
    bd = &thiz->bd[thiz->rxIndexEMAC];
    bd->Buffer = ((uint32_t)my_pbuf) + 64;//XXX magic number
    thiz->rxIndexEMAC++;
    if (thiz->rxIndexEMAC > thiz->rxBuffLimit) {
        /* wrap back */
        thiz->rxIndexEMAC = thiz->txBuffLimit + 1;
        /* the last BD */
        bd->C_S_L = (EMAC_BD_FIELD_MSK(RX_IRQ) | EMAC_BD_FIELD_MSK(RX_E) | (ETH_MAX_BUFFER_SIZE << 16) | EMAC_BD_FIELD_MSK(RX_WR));
    } else {
        bd->C_S_L = (EMAC_BD_FIELD_MSK(RX_IRQ) | EMAC_BD_FIELD_MSK(RX_E) | (ETH_MAX_BUFFER_SIZE << 16));
    }
#endif
}
#endif

static struct pbuf *low_level_input(struct netif *netif)
{
    uint16_t pkt_len;
    uint16_t max_len;
    uint32_t temval;
    struct pbuf *h = NULL;
    //uint8_t *payload;
    EMAC_BD_Desc_Type *bd;
    bd = &thiz->bd[thiz->rxIndexCPU];

    if(bd->C_S_L & EMAC_BD_FIELD_MSK(RX_E)){
        printf("RX BD is empty\r\n");
        h = NULL;
    } else {
        temval = BL_RD_REG(EMAC_BASE, EMAC_PACKETLEN);
        max_len = BL_GET_REG_BITS_VAL(temval, EMAC_MAXFL);
        pkt_len = (bd->C_S_L & EMAC_BD_FIELD_MSK(RX_LEN)) >> BD_RX_LEN_POS;
        printf("max_len %u, min_len %lu, pkt_len %u\r\n", max_len,
                BL_GET_REG_BITS_VAL(temval, EMAC_MINFL), pkt_len);
        //check length
        if (pkt_len > max_len) {
            printf("pkt is too huge %d\r\n", pkt_len);
            return NULL;
        }
        if (bd->C_S_L & 0xFF) {
            printf("RX bd %x\r\n", bd->C_S_L & 0xFF);
        }
        if ((bd->C_S_L >>16) == ETH_MAX_BUFFER_SIZE) {
            printf("Bug now...\r\n");
        }
#if 0
        //TODO more check
        payload = (uint8_t *)bd->Buffer;
        printf("input idx %d\r\n", thiz->rxIndexCPU);
        eth_pbuf_custom_t *my_pbuf = (eth_pbuf_custom_t *)(payload - 64);
        my_pbuf->p.custom_free_function = rx_free_custom;
        my_pbuf->bd = bd;
        my_pbuf->idx = thiz->rxIndexCPU;
        h = pbuf_alloced_custom(PBUF_RAW, pkt_len, PBUF_REF, &my_pbuf->p, payload, pkt_len); 
        bd->C_S_L = ETH_MAX_BUFFER_SIZE;
        if ((++thiz->rxIndexCPU) > thiz->rxBuffLimit) {
            /* wrap back */
            thiz->rxIndexCPU = thiz->txBuffLimit + 1;
        }
#else

#if PBUF_POOL_SIZE
        h = pbuf_alloc(PBUF_RAW, pkt_len, PBUF_POOL);
#else
        h = pbuf_alloc(PBUF_RAW, pkt_len, PBUF_RAM);
#endif
        if (h) {
            pbuf_take(h, (const void*)bd->Buffer, pkt_len);
        }

        if ((++thiz->rxIndexCPU) > thiz->rxBuffLimit) {
            /* wrap back */
            thiz->rxIndexCPU = thiz->txBuffLimit + 1;
            bd->C_S_L = (EMAC_BD_FIELD_MSK(RX_IRQ) | EMAC_BD_FIELD_MSK(RX_E) | (ETH_MAX_BUFFER_SIZE << 16) | EMAC_BD_FIELD_MSK(RX_WR));
        } else {
            bd->C_S_L = (EMAC_BD_FIELD_MSK(RX_IRQ) | EMAC_BD_FIELD_MSK(RX_E) | (ETH_MAX_BUFFER_SIZE << 16));
        }
#endif
    }
    printf("h addr %p\r\n", h);
    return h;
}

static unsigned int rx_counter;
static inline err_t bl702ethernetif_input(struct netif *netif)
{
    err_t err = ERR_OK;
    struct pbuf *p;
    EMAC_BD_Desc_Type *bd;

    /* move received packet into a new pbuf */
    do {

        bd = &thiz->bd[thiz->rxIndexCPU];
        if(bd->C_S_L & EMAC_BD_FIELD_MSK(RX_E)) {

            printf("low level input idx %d, empty\r\n", thiz->rxIndexCPU);

            if (thiz->rxIndexCPU == thiz->rxBuffLimit) {
                thiz->rxIndexCPU = thiz->txBuffLimit + 1;
                bd->C_S_L = (EMAC_BD_FIELD_MSK(RX_IRQ) | EMAC_BD_FIELD_MSK(RX_E) | (ETH_MAX_BUFFER_SIZE << 16) | EMAC_BD_FIELD_MSK(RX_WR));
            } else {
                bd->C_S_L = (EMAC_BD_FIELD_MSK(RX_IRQ) | EMAC_BD_FIELD_MSK(RX_E) | (ETH_MAX_BUFFER_SIZE << 16));
                thiz->rxIndexCPU ++;
            }
            continue;
        }

        printf("low level input idx %d\r\n", thiz->rxIndexCPU);
        p = low_level_input(netif);

        rx_counter++;
        /* no packet could be read, silently ignore this */
        if (p == NULL) return ERR_MEM;

        /* entry point to the LwIP stack */
        err = netif->input(p, netif);

        if (err != ERR_OK)
        {
            printf("ethernetif_input: IP input error\n");
            pbuf_free(p);
        }
    } while (emac_bd_get_cur_rx_buffer_active() != thiz->rxIndexCPU);

    return err;
}

/* recv a pkt */
void EMAC_RX_Done_Callback(void)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    
    if (NULL == DequeueTaskHandle) {
        return;
    }

    xTaskNotifyFromISR(DequeueTaskHandle, 0x02, eSetBits, &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
}

void EMAC_RX_Error_Callback(int index)
{
    if (thiz->bd[index].C_S_L & EMAC_BD_FIELD_MSK(RX_OR)) {
        printf("EMAC RX OR Error @ %d\r\n", index);
    }

    if (thiz->bd[index].C_S_L & EMAC_BD_FIELD_MSK(RX_RE)) {
        printf("EMAC RX_RE Error @ %d\r\n", index);
    }

    if (thiz->bd[index].C_S_L & EMAC_BD_FIELD_MSK(RX_DN)) {
        printf("EMAC RX_DN Error @ %d\r\n", index);
    }

    if (thiz->bd[index].C_S_L & EMAC_BD_FIELD_MSK(RX_TL)) {
        printf("EMAC RX_TL Error @ %d\r\n", index);
    }

    if (thiz->bd[index].C_S_L & EMAC_BD_FIELD_MSK(RX_CRC)) {
        printf("EMAC RX_CRC Error @ %d\r\n", index);
    }

    if (thiz->bd[index].C_S_L & EMAC_BD_FIELD_MSK(RX_LC)) {
        printf("EMAC RX_LC Error @ %d\r\n", index);
    }

    if (index == thiz->rxBuffLimit) {
        thiz->bd[index].C_S_L = (EMAC_BD_FIELD_MSK(RX_IRQ) | EMAC_BD_FIELD_MSK(RX_E) | (ETH_MAX_BUFFER_SIZE << 16) | EMAC_BD_FIELD_MSK(RX_WR));
    } else {
        thiz->bd[index].C_S_L = (EMAC_BD_FIELD_MSK(RX_IRQ) | EMAC_BD_FIELD_MSK(RX_E) | (ETH_MAX_BUFFER_SIZE << 16));
    }
}

