bouffalolab/bl_iot_sdk-components/platform/soc/bl702/bl702_ethernet/Src/eth_bd.c
    memcpy(emacCfg.macAddr, addr, sizeof(emacCfg.macAddr));
    EMAC_GPIO_Init();

#if USER_EMAC_OUTSIDE_CLK  // use outside clk
    GLB_Set_ETH_REF_O_CLK_Sel(GLB_ETH_REF_CLK_OUT_OUTSIDE_50M);
#else  // use inside clk
    //enable audio clock for emac */
    PDS_Enable_PLL_Clk(PDS_PLL_CLK_48M);
    PDS_Set_Audio_PLL_Freq(AUDIO_PLL_50000000_HZ);
    GLB_Set_ETH_REF_O_CLK_Sel(GLB_ETH_REF_CLK_OUT_INSIDE_50M);
#endif

    GLB_AHB_Slave1_Clock_Gate(0,BL_AHB_SLAVE1_EMAC);
    EMAC_Interrupt_Init();
    emac_init(&emacCfg);
    EMAC_BD_Init();
    emac_enable();
}

void __attribute__((weak)) eth_user_init(struct netif *netif) 
{
    uint8_t *mac = netif->hwaddr, addr[8];

    extern int bl_wireless_mac_addr_get(uint8_t mac[8]);
    bl_wireless_mac_addr_get(addr);
    mac[0] = 0x18;
    mac[1] = 0xB0;
    mac[2] = 0x09;
    mac[3] = addr[5];
    mac[4] = addr[6];
    mac[5] = addr[7];
}

/**
 * In this function, the hardware should be initialized.
 * Called from ethernetif_init().
 *
 * @param netif the already initialized lwip network interface structure
 *        for this ethernetif
 */

static err_t low_level_init(struct netif *netif)
{
    int ret = 0;

    netif->hwaddr_len = ETHARP_HWADDR_LEN;
    netif->mtu = 1500;
    netif->flags = NETIF_FLAG_BROADCAST|NETIF_FLAG_ETHARP|NETIF_FLAG_LINK_UP|NETIF_FLAG_IGMP;
    eth_user_init(netif);

    printf("low level init\r\n");

    borad_eth_init(netif->hwaddr);

    /* scan eth_phy */
    ret = eth_phy_scan(&phy_ctrl, EPHY_ADDR_MIN, EPHY_ADDR_MAX);
    if (ret < 0) {
        log_error("eth_phy_scan failed\r\n");
        return -ERR_IF;
    }

    /* eth_phy init */
    ret = eth_phy_init(&phy_ctrl, &phy_cfg);
    if (ret < 0) {
        log_error("eth_phy_init failed\r\n");
        return -ERR_IF;
    }

    /* update phy address */
    phyCfg.phyAddress = phy_ctrl.phy_addr;

    /* wait link up */
    log_info("waiting link_up...\r\n");
    while (eth_phy_ctrl(&phy_ctrl, EPHY_CMD_GET_LINK_STA, 0) != EPHY_LINK_STA_UP) {
        arch_delay_ms(10);
    }
    log_info("EPHY LINK UP\r\n");

    /* dump registers */
    eth_phy_dump_registers(&phy_ctrl);

    /* update speed mode */
    int speed_mode = eth_phy_ctrl(&phy_ctrl, EPHY_CMD_GET_SPEED_MODE, 0);
    if (speed_mode == EPHY_SPEED_MODE_10M_HALF_DUPLEX) {
        phyCfg.speed = EMAC_SPEED_10M;
        phyCfg.duplex = EMAC_MODE_HALFDUPLEX;
    } else if (speed_mode == EPHY_SPEED_MODE_10M_FULL_DUPLEX) {
        phyCfg.speed = EMAC_SPEED_10M;
        phyCfg.duplex = EMAC_MODE_FULLDUPLEX;
    } else if (speed_mode == EPHY_SPEED_MODE_100M_HALF_DUPLEX) {
        phyCfg.speed = EMAC_SPEED_100M;
        phyCfg.duplex = EMAC_MODE_HALFDUPLEX;
    } else if (speed_mode == EPHY_SPEED_MODE_100M_FULL_DUPLEX) {
        phyCfg.speed = EMAC_SPEED_100M;
        phyCfg.duplex = EMAC_MODE_FULLDUPLEX;
    }

#if LWIP_IPV6
    netif->flags |= (NETIF_FLAG_ETHERNET | NETIF_FLAG_IGMP | NETIF_FLAG_MLD6);
    netif->output_ip6 = ethip6_output;
#endif

    return ERR_OK;
}

static inline void bl702ethernetif_output(struct netif *netif)
{
    struct unsent_item *item;
    struct pbuf *q, *p;
    EMAC_BD_Desc_Type *bd;
    int wrap_found, offset;

    bd = &thiz->bd[thiz->txIndexCPU];
    while (0 == (bd->C_S_L & EMAC_BD_FIELD_MSK(TX_RD)) && ctx->unsent_num) {

        __disable_irq();
        item = (struct unsent_item *)utils_list_pop_front(&ctx->unsent);
        ctx->unsent_num--;
        __enable_irq();

        p = item->p;
        p->len -= PBUF_LINK_ENCAPSULATION_HLEN;
        p->tot_len -= PBUF_LINK_ENCAPSULATION_HLEN;
        p->payload += PBUF_LINK_ENCAPSULATION_HLEN;

        if ((++thiz->txIndexCPU) > thiz->txBuffLimit) {
            /* wrap back */
            thiz->txIndexCPU = 0;
            wrap_found = 1;
        } else {
            wrap_found = 0;
        }

        offset = 0;
        for (q = p; q != NULL; q = q->next) {
            memcpy((uint8_t *)bd->Buffer + offset, (uint8_t*)q->payload, q->len);
            offset += q->len;
        }
        pbuf_free(p);

        if (offset >= ETH_MAX_BUFFER_SIZE) {
            printf ("bl702ethernetif_output %d >= %d\r\n", offset, ETH_MAX_BUFFER_SIZE);
        }

        bd->C_S_L = (wrap_found ? EMAC_BD_FIELD_MSK(TX_WR) : 0) | EMAC_TX_COMMON_FLAGS | p->tot_len << BD_TX_LEN_POS;
        bd = &thiz->bd[thiz->txIndexCPU];
    }
}

void unsent_recv_task(void *pvParameters)
{
    uint32_t NotifyValue;
    BaseType_t recv;
    struct netif *netif = (struct netif *)pvParameters;

    while(1) {
        NotifyValue = 0;
        recv = xTaskNotifyWait(0, ULONG_MAX, &NotifyValue, 200);
        if (recv == pdTRUE) {

            _emac_phy_is_link_up();
            if (NotifyValue & (1 << 0)) {
                bl702ethernetif_output(netif);
            }
            if (NotifyValue & (1 << 1)) {
                bl702ethernetif_input(netif);
            }
        } else {
            /*XXX only work when we has no EVENT. Maybe buggy here??*/
            _emac_phy_if_init();
        }
    }
}

static err_t low_level_output(struct netif *netif, struct pbuf *p)
{
    struct unsent_item *item;

    if (pbuf_header(p, PBUF_LINK_ENCAPSULATION_HLEN)) {
        printf("[TX] Reserve room failed for header\r\n");
        return ERR_IF;
    }
    item = (struct unsent_item *)(((uintptr_t)(p->payload + 3))&(~3));
    item->p = p;

    if (NULL == DequeueTaskHandle) {
        return ERR_IF;
    }
    
    pbuf_ref(p);

    __disable_irq();
    utils_list_push_back(&ctx->unsent, (struct utils_list_hdr *)&(item->hdr));
    ctx->unsent_num++;
    __enable_irq();
    xTaskNotify(DequeueTaskHandle, 0x01, eSetBits);

    return ERR_OK;
}

err_t eth_init(struct netif *netif)
{
    LWIP_ASSERT("netif != NULL", (netif != NULL));

    netif->name[0] = 'e';
    netif->name[1] = 't';
    netif->hostname = "702";
    netif->output = etharp_output;
    netif->linkoutput = low_level_output;

    int err = low_level_init(netif);
    if (err != ERR_OK) {
        return err;
    }

    xTaskCreate(unsent_recv_task, (const char *)"Ontput_Unsent_queue", 1024, netif, 29, &DequeueTaskHandle);

    return ERR_OK;
}

int ethernet_init(eth_callback cb)
{
    p_eth_callback = cb;
    return 0;
}

